# FamilyLoadingIntoDocumentEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyLoadingIntoDocumentEventArgs Class
Members See Also
---
The event arguments used by the FamilyLoadingInto event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class FamilyLoadingIntoDocumentEventArgs : RevitAPIPreDocEventArgs
```

Visual Basic
---
```text
Public Class FamilyLoadingIntoDocumentEventArgs _
	Inherits RevitAPIPreDocEventArgs
```

Visual C++
---
```text
public ref class FamilyLoadingIntoDocumentEventArgs : public RevitAPIPreDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreDocEventArgs Autodesk.Revit.DB.Events..::..FamilyLoadingIntoDocumentEventArgs
# See Also
FamilyLoadingIntoDocumentEventArgs Members
Autodesk.Revit.DB.Events Namespace